Repository: 84000/data-translation-memory
Catalog: Toh_252-The_Fourfold_Accomplishment-v2.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བཞི་པ་སྒྲུབ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།
en: The Noble Mahāyāna Sūtra The Fourfold Accomplishment

source: སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་མཉན་ཡོད་ན་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན།
en: The Blessed One was in the Jeta Grove, in Anāthapiṇḍada’s park at Śrāvastī.

source: དགེ་སློང་ལྔ་བརྒྱ་ཙམ་གྱི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བརྒྱ་སྟོང་ཐམས་ཅད་ཀྱང་གོ་ཆ་ཆེན་པོ་བགོས་པ་ཤ་སྟག་དང་། འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པའི་ལྷའི་བུ་རྣམས་དང་ཐབས་ཅིག་ཏུ་བཞུགས་ཏེ
en: He was residing there with a great saṅgha of five hundred monks, one hundred thousand bodhisattvas who had all donned the great armor, and the gods who inhabit the desire and form realms.

source: དེ་ནས་བཅོམ་ལྡན་འདས་འཁོར་བརྒྱ་སྟོང་དུ་མས་ཡོངས་སུ་བསྐོར་ཅིང་མདུན་གྱིས་བལྟས་ནས་ཆོས་སྟོན་ཏོ། །
en: There, the Blessed One, surrounded and revered by this retinue of hundreds of thousands of beings, taught the Dharma.

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བཅོམ་ལྡན་འདས་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་རིན་པོ་ཆེའི་གདུགས་དཔག་ཚད་བཅུའི་ཚད་ཙམ་ཐོགས་ཏེ།
en: Mañjuśrī­kumāra­bhūta raised a jeweled parasol measuring ten leagues in diameter as an offering to the Blessed One and

source: བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་འཛིན་ཏོ། །
en: held it above the Blessed One’s head.

source: དེ་ནས་འཁོར་དེ་ཉིད་དུ་དགའ་ལྡན་གྱི་རིས་ཀྱི་ལྷའི་བུ་དཔལ་བཟངས་ལྡན་ཞེས་བྱ་བ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་གཡོག་དང་བཅས་ཏེ་
en: Within the retinue was a god from the Heaven of Joy named Śrībhadra whose progress toward unsurpassed and perfect awakening had become irreversible.

source: འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ནས་འདུག་པ་དེ་སྟན་ལས་ལངས་ཏེ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ།
en: Together with his attendants, he had joined the retinue and taken his seat. Now he rose from his seat, draped his shawl over one shoulder, and knelt on his right knee.

source: འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །
en: Joining his palms, he bowed toward Mañjuśrī­kumāra­bhūta and inquired of him,

source: འཇམ་དཔལ་ཁྱོད་ད་དུང་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་མཛད་པས་མ་ཚིམ་མམ།
en: “Mañjuśrī, have you still not had enough of making offerings to the Thus-Gone One?”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་འདི་ཇི་སྙམ་དུ་སེམས།
en: “Divine being, tell me,” Mañjuśrī asked in return,

source: རྒྱ་མཚོ་ཆེན་པོ་ཆུ་ཐམས་ཅད་ལེན་པས་གཞར་ཡང་ཆོག་ཤེས་སམ།
en: “is the ocean ever satiated by all of the water that it receives?”

source: ལྷའི་བུས་སྨྲས་པ། འཇམ་དཔལ་དེ་ནི་མ་ལགས་སོ། །
en: “No, Mañjuśrī, it is not,” replied the god.

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་དེ་བཞིན་དུ་རྒྱ་མཚོ་ཆེན་པོ་མཚོ་གཏིང་དཔག་དཀའ་བ་དེ་ལྟ་བུའི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཚད་མེད་དཔག་ཏུ་མེད་པ་བཙལ་བར་བྱ་སྟེ
en: Mañjuśrī then said, “Divine being, bodhisattvas seek boundless and immeasurable omniscient wisdom that is as difficult to fathom as the depths of the great ocean,

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱིས་གཞར་ཡང་ཚིམ་པར་མི་བྱའོ། །
en: so they can never have enough of making offerings to the Thus-Gone One.”

source: ལྷའི་བུས་སྨྲས་པ། འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔས་ཅི་ལ་དམིགས་ཏེ་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་བགྱི།
en: “Mañjuśrī, what should bodhisattvas focus on when they make offerings to the Thus-Gone One?” asked the god.

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔས་དམིགས་པ་བཞིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་བྱའོ། །
en: Mañjuśrī replied, “Divine being, there are four things that bodhisattvas should focus on when they make offerings to the Thus-Gone One.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་དམིགས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགྲོལ་བ་ལ་དམིགས་པ་དང་། དཀོན་མཆོག་གསུམ་གྱི་གདུང་མི་འཆད་པར་བྱ་བ་ལ་དམིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་ཡོན་ཏན་བཀོད་པ་ཡོངས་སུ་གཟུང་བ་ལ་དམིགས་པ་སྟེ།
en: These four are omniscience, liberating all beings, ensuring that the lineage of the Three Jewels is not broken, and attaining the array of qualities of the buddhafield.

source: ལྷའི་བུ་བྱང་ཆུབ་སེམས་དཔས་དམིགས་པ་བཞི་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པར་བྱའོ། །
en: Divine being, bodhisattvas should make offerings to the Thus-Gone One while focusing on those four things.”

source: ལྷའི་བུས་སྨྲས་པ། འཇམ་དཔལ་ཁྱོད་ཀྱིས་ཚངས་པའི་རིས་ཀྱི་ལྷའི་བུའི་ནང་དུ་ཚངས་པ་གཙུག་ཕུད་ཅན་ལ་བྱང་ཆུབ་སེམས་དཔའི་ལམ་བཞི་པ་སྒྲུབ་པ་ཞེས་བགྱི་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་བཤད་པ་དེ།
en: “Mañjuśrī,” said the god, “when you were among the Brahmā realm gods you gave a Dharma teaching to Brahmā Śikhin called The Fourfold Accomplishment of the Bodhisattva Path.

source: འཇམ་དཔལ་ལེགས་པར་བཤད་དུ་གསོལ།
en: Mañjuśrī, would you please teach that?

source: དེ་ལ་ནི་བདག་དང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་འདི་ཡང་ཉན་པར་འཚལ་ལོ། །
en: I and everyone in this assembly would like to hear it.

source: འཇམ་དཔལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་ཆོས་ཀྱི་སེར་སྣ་མ་མཆིས།
en: Mañjuśrī, bodhisattvas are not stingy with the Dharma,

source: སློབ་དཔོན་གྱི་ཆོས་ཀྱི་དཔེ་མཁྱུད་ཀྱང་མ་མཆིས།
en: nor are they tight-fisted with the Dharma as teachers.”

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ། ལྷའི་བུ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་།
en: “Divine being,” Mañjuśrī replied, “in that case listen well, pay attention, and

source: བཞི་པ་སྒྲུབ་པ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་རྣམ་གྲངས་དེ་ངས་ཁྱོད་ལ་བཤད་དོ། །
en: I will explain the Dharma teaching called The Fourfold Accomplishment to you.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལྷག་པའི་བསམ་པའི་སེམས་བསྐྱེད་པར་རིག་པར་བྱའོ། །
en: “Divine being, these are the four altruistic intentions that bodhisattvas generate:

source: ལྷའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་ཅན་དཔག་ཏུ་མེད་པ་བསྡུ་བའི་ཕྱིར་སེམས་བསྐྱེད་པ་དང་།
en: bodhisattvas generate the intention to gather together immeasurable beings,

source: སེམས་ཅན་དཔག་ཏུ་མེད་པ་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་སེམས་བསྐྱེད་པ་དང་།
en: they generate the intention to ripen immeasurable beings,

source: དགེ་བའི་རྩ་བ་དཔག་ཏུ་མེད་པ་བསགས་པའི་ཕྱིར་སེམས་བསྐྱེད་པ་དང་།
en: they generate the intention to accumulate immeasurable roots of virtue, and

source: སངས་རྒྱས་ཀྱི་ཆོས་དཔག་ཏུ་མེད་པ་མངོན་པར་རྫོགས་པར་རྟོགས་པར་བྱ་བའི་ཕྱིར་སེམས་བསྐྱེད་པ་སྟེ།
en: they generate the intention to perfectly realize the boundless buddha qualities.

source: ལྷའི་བུ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལྷག་པའི་བསམ་པའི་སེམས་བསྐྱེད་པར་རིག་པར་བྱའོ། །
en: Divine being, those are the four altruistic intentions that bodhisattvas generate.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་བྲག་ལྟ་བུ་ཡིན་ནོ། །
en: “Divine being, these are the four attitudes bodhisattvas generate that are like a rock:

source: སློང་བ་རྣམས་ལ་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དང་།
en: an attitude that has no hostility toward those who make requests,

source: ལོག་པར་ཞུགས་པ་རྣམས་ལ་སྙིང་རྗེ་བའི་སེམས་དང་།
en: an attitude of compassion toward those who have gone astray,

source: ཤེས་རབ་ལས་མ་ཉམས་པའི་སེམས་དང་། རྩོམ་པ་ཉམས་འོག་ཏུ་ཆུད་པར་བྱེད་པའི་སེམས་ཏེ།
en: an attitude of not losing insight, and an attitude of bringing all undertakings to completion.

source: ལྷའི་བུ་བཞི་པོ་དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་བྲག་ལྟ་བུ་ཡིན་ནོ། །
en: Divine being, those are the four attitudes bodhisattvas generate that are like a rock.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་མངོན་པར་འཕགས་པ་ཡིན་ནོ། །
en: “Divine being, these are the four attitudes bodhisattvas generate that are superior:

source: ཚུལ་ཁྲིམས་མངོན་པར་འཕགས་པ་དང་། ཐོས་པ་མངོན་པར་འཕགས་པ་དང་། བྱམས་པ་ཆེན་པོ་མངོན་པར་འཕགས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་མངོན་པར་འཕགས་པ་སྟེ།
en: superior discipline, superior learning, superior great love, and superior great compassion.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་བརྟན་པ། སྙིང་པོ་ཅན། མི་ཕྱེད་པ། རྡོ་རྗེ་ལྟ་བུའོ། །
en: “Divine being, these are the four attitudes bodhisattvas generate that are stable, substantial, inseparable, and like a vajra:

source: བསམ་པ་ལས་མི་ཕྱེད་པ་དང་།
en: not being separated from the intention,

source: མཛའ་བ་ལས་མི་ཕྱེད་པ་དང་།
en: not being separated from spiritual companions,

source: ནན་ཏན་ལས་མི་ཕྱེད་པ་དང་།
en: not being separated from striving, and

source: ཐེག་པ་ཆེན་པོ་ལས་མི་ཕྱེད་པ་སྟེ།
en: not being separated from the Great Vehicle.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་བསྙེན་དཀའ་བ་ཡིན་ནོ། །
en: “Divine being, these are the four attitudes bodhisattvas generate that are difficult to accomplish:

source: ཉོན་མོངས་པ་དང་མ་འདྲེས་པ་དང་།
en: not being involved with the afflictions;

source: རྙེད་པ་དང་། བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ཐམས་ཅད་དང་མ་འདྲེས་པ་དང་།
en: not being involved with gain, honor, and praise;

source: ཐེག་པ་དམན་པ་དང་མ་འདྲེས་པ་དང་།
en: not being involved with a lesser vehicle;

source: སྐྱེ་བོ་མི་བགྲུངས་པ་ཐམས་ཅད་དང་མ་འདྲེས་པ་སྟེ།
en: and not being involved with crude people.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སེམས་བསྐྱེད་པ་བླ་ན་མེད་པའོ། །
en: “Divine being, these are the four attitudes bodhisattvas generate that are unsurpassed:

source: ཕོངས་པའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏོང་བའི་སེམས་དང་།
en: the wish to relinquish all manner of pleasing things,

source: བྱིན་ནས་འགྱོད་པ་མེད་པའི་སེམས་དང་།
en: having no regret after giving them away,

source: རྣམ་པར་སྨིན་པ་ལ་རེ་བ་མེད་པའི་སེམས་དང་།
en: not wishing for any result, and

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་སེམས་ཏེ།
en: the attitude of dedication to awakening.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱི་བོར་ཕྱིན་པའི་ཆོས་སོ། །
en: “Divine being, these are the four qualities that crown bodhisattvas:

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: the perfection of wisdom,

source: ཐབས་ལ་མཁས་པ་དང་།
en: skill in methods,

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་དང་།
en: understanding the true Dharma, and

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྟེ།
en: bringing beings to fruition.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱི་ལམ་སྟོན་པར་བྱེད་པའོ། །
en: “Divine being, these are the four that demonstrate the bodhisattvas’ path to awakening:

source: ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ལ་བརྩོན་པ་དང་།
en: exerting oneself in the perfections,

source: བསྡུ་བའི་དངོས་པོ་རྣམས་ཀྱི་རྗེས་སུ་འཐུན་པ་དང་།
en: acting in accord with the means for drawing beings to the path,

source: ཚངས་པའི་གནས་སྒྲུབ་པ་དང་།
en: accomplishing the abodes of Brahmā, and

source: མངོན་པར་ཤེས་པས་རྣམ་པར་རྩེ་བ་སྟེ།
en: demonstrating playful mastery of the supernatural perceptions.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་གྱ་ནོམ་པ་དམ་པ་མཆོག་ཡིན་ནོ། །
en: “Divine being, these four are excellent, holy, and supreme among the qualities of the bodhisattvas:

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བ་མེད་པ་དང་།
en: having no hostility toward anyone,

source: གང་དག་དེ་དང་འགལ་བར་བྱེད་པ་དེ་དག་ཉིད་ལ་རབ་ཏུ་ཐར་བར་བྱ་བར་སེམས་བསྐྱེད་པ་དང་།
en: generating the wish to liberate those who oppose oneself,

source: ཇི་ཙམ་གྱི་ཡུལ་རྒྱ་ཆེན་པོ་ཞིག་འབྱོར་ཀྱང་དེ་ལ་བག་ཡོད་པ་དང་།
en: being conscientious regardless of one’s wealth or the vastness of one’s domain, and

source: ཅི་ཙམ་དུ་དབུལ་བས་ཕོངས་པར་གྱུར་ཀྱང་ཆོས་སྤྱོད་པ་སྟེ།
en: acting in accord with the Dharma, no matter how destitute and poor one may be.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མོས་པའོ། །
en: “Divine being, these are the four inclinations of bodhisattvas:

source: ཁྱིམ་པར་གྱུར་ན་བདག་གི་ལོངས་སྤྱོད་ཀྱིས་ཆོག་ཤེས་པ་དང་།
en: being satisfied with one’s own wealth as a householder,

source: གཞན་གྱི་ནོར་ལ་མངོན་པར་འདོད་པ་མེད་པ་དང་།
en: harboring no desire for another’s wealth,

source: རབ་ཏུ་བྱུང་ནས་འཕགས་པའི་རིགས་ཀྱིས་ཆོག་ཤེས་པ་དང་།
en: being satisfied with the family of the noble ones after one has gone forth, and

source: སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པ་སྟེ།
en: adopting ascetic practices and reducing one’s material possessions.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྦྱིན་པའོ། །
en: “Divine being, these are the four gifts of bodhisattvas: the gift of Dharma;

source: ཆོས་སྦྱིན་པ་དང་།
en: the gift of material wealth;

source: ཟང་ཟིང་སྦྱིན་པ་དང་། ཤོག་ཤོག་དང་། སྣག་ཚ་དང་། སྨྱུ་གུ་དང་། གླེགས་བམ་སྦྱིན་པ་དང་།
en: the gift of paper, ink, pens, and books; and

source: ཆོས་སྨྲ་བ་ལ་བསམ་པ་ཐག་པ་ནས་ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པ་སྟེ།
en: the gift of wholeheartedly exclaiming ‘Well done!’ to those who teach the Dharma.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་པོ་ཉིད་དོ། །
en: “Divine being, these are the four essentials of bodhisattvas:

source: ཐོས་པ་ལས་ནན་ཏན་སྙིང་པོ་ཉིད་དང་།
en: essential perseverance rather than studying,

source: ལོངས་སྤྱོད་རྣམས་ལས་གཏོང་བ་སྙིང་པོ་ཉིད་དང་།
en: essential relinquishment rather than having possessions,

source: !ལུས་ལས་བླ་མ་ལས་བསྙེན་བཀུར་བྱ་བ་སྙིང་པོ་ཉིད་དང་།
en: essential service to the teacher rather than to the body, and

source: སྲོག་ལས་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་སྙིང་པོ་ཉིད་དེ།
en: the essential development of roots of virtue rather than a livelihood.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡོངས་སུ་གཏང་བར་མི་བྱ་བའོ། །
en: “Divine being, these are the four things that bodhisattvas should not forsake:

source: བྱང་ཆུབ་ཀྱི་སེམས་ཡོངས་སུ་གཏང་བར་མི་བྱ་བ་དང་།
en: they should not forsake the thought of awakening,

source: དམ་པའི་ཆོས་ཡོངས་སུ་གཏང་བར་མི་བྱ་བ་དང་།
en: they should not forsake the holy Dharma,

source: སེམས་ཅན་ཡོངས་སུ་གཏང་བར་མི་བྱ་བ་དང་།
en: they should not forsake beings, and

source: དགེ་བའི་རྩ་བའི་ཆོས་ཐམས་ཅད་ཡོངས་སུ་བཙལ་བ་ཡོངས་སུ་གཏང་བར་མི་བྱ་བ་སྟེ།
en: they should not forsake pursuing any qualities that are roots of virtue.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྐྱེད་མོས་ཚལ་ལོ། །
en: “Divine being, these are the four motives of bodhisattvas:

source: དགོན་པ་ལ་གནས་པ་དང་།
en: dwelling in the deep forest,

source: དབེན་པ་ལ་མངོན་པར་དགའ་བ་དང་།
en: delighting in solitude,

source: དགེ་བའི་ཆོས་ལ་འདུན་པ་དང་།
en: yearning for virtuous qualities, and

source: ཐབས་མཁས་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་སྟེ།
en: skillfully ripening beings.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཞལ་མེད་ཁང་ངོ་། །
en: “Divine being, these are the four mansions of bodhisattvas:

source: ཚངས་པའི་གནས་དང་།
en: the abodes of Brahmā,

source: འབེལ་བའི་གཏམ་གྱི་ཆོས་མཉན་པ་ལ་དགའ་བ་མྱོང་བར་བྱེད་པ་དང་།
en: being delighted when hearing the Dharma expounded,

source: སྟོང་པ་ཉིད་ལ་ངེས་པར་སེམས་པ་དང་།
en: reflecting on emptiness, and

source: སྐྱེ་བོ་རིས་འཐུན་པ་དང་འདུ་བ་སྟེ།
en: gathering with beings of the same spiritual lineage.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནོར་མི་ཟད་པའོ། །
en: “Divine being, these four are the bodhisattvas’ inexhaustible wealth:

source: ཐོས་པའི་ནོར་དང་།
en: the wealth of learning,

source: ཆོས་སྟོན་པའི་ནོར་དང་།
en: the wealth of teaching the Dharma,

source: སེམས་ཅན་དབུལ་པོ་སྡུད་པའི་ནོར་དང་།
en: the wealth of assembling beings in need, and

source: བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བའི་ནོར་ཏེ།
en: the wealth of dedication to awakening.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་གཏེར་རོ། །
en: “Divine being, these are the four treasures of bodhisattvas:

source: གཟུངས་ཀྱི་གཏེར་དང་།
en: the treasure of retention,

source: སྤོབས་པའི་གཏེར་དང་།
en: the treasure of eloquence,

source: ཆོས་ཀྱི་གཏེར་དང་།
en: the treasure of the Dharma, and

source: ལོངས་སྤྱོད་ཟད་མི་ཤེས་པར་ཡོངས་སུ་བསྔོ་བའི་གཏེར་ཏེ།
en: the treasure of dedication to inexhaustible enjoyment.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མངོན་པར་འབྱུང་བའོ། །
en: “Divine being, these are the bodhisattvas’ four types of departure:

source: འདུ་འཛི་ལས་འབྱུང་བ་དང་།
en: departure from society,

source: ཡུལ་ཐམས་ཅད་ལས་འབྱུང་བ་དང་།
en: departure from all inhabited lands,

source: འཕགས་པ་མ་ཡིན་པའི་བསམ་པ་ལས་འབྱུང་བ་དང་།
en: departure from ignoble intentions, and

source: ཁམས་གསུམ་ཐམས་ཅད་ལས་འབྱུང་བ་སྟེ།
en: departure from all the three realms.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེ་བའོ། །
en: “Divine being, these are the bodhisattvas’ four types of happiness:

source: དངོས་པོ་ཐམས་ཅད་ལ་མི་ལྟ་བའི་ཕྱིར་བདག་གི་བ་མེད་ཅིང་ཡོངས་སུ་འཛིན་པ་མེད་པའི་བདེ་བ་དང་།
en: the happiness of being free from possessiveness and grasping due to a disregard for all material things,

source: ཡུལ་སྤངས་པས་དབེན་པའི་བདེ་བ་དང་།
en: the happiness of solitude due to abandoning one’s homeland,

source: ཉོན་མོངས་པ་མེད་པའི་ཕྱིར་ཞི་བའི་བདེ་བ་དང་།
en: the happiness of quiescence due to relinquishing the afflictions, and

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་མི་གཏོང་བའི་ཕྱིར་མྱ་ངན་ལས་འདས་པའི་བདེ་བ་སྟེ།
en: the happiness of attaining nirvāṇa by not forsaking beings.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མཆོག་ཏུ་དགའ་བའོ། །
en: “Divine being, these are the bodhisattvas’ four supreme joys:

source: དེ་བཞིན་གཤེགས་པ་མཐོང་བས་མཆོག་ཏུ་དགའ་བ་དང་།
en: supreme joy due to seeing the Thus-Gone One,

source: ཆོས་ཐོས་པས་མཆོག་ཏུ་དགའ་བ་དང་།
en: supreme joy due to hearing the Dharma,

source: སྦྱིན་པ་ལ་འགྱོད་པ་མེད་པས་མཆོག་ཏུ་དགའ་བ་དང་།
en: supreme joy due to giving without regret, and

source: སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བ་སྐྱེད་པས་མཆོག་ཏུ་དགའ་བ་སྟེ།
en: supreme joy due to engendering happiness in all beings.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདེན་པའོ། །
en: “Divine being, these are the bodhisattvas’ four truths:

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་གཏོང་བ་དང་།
en: not forsaking the thought of awakening,

source: ཡི་དམ་ལས་མི་ཉམས་པ་དང་།
en: not breaking one’s commitments,

source: སྐྱབས་སུ་སོང་བ་དག་ཡོངས་སུ་མི་གཏོང་བ་དང་།
en: not forsaking those who have taken refuge, and

source: ངག་བསྡམས་པས་ཚིག་ཐམས་ཅད་བདེན་པ་སྟེ།
en: restraining one’s speech so that one always speaks the truth.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དགེ་བའི་ཆོས་སོ། །
en: “Divine being, these are the bodhisattvas’ four virtuous qualities:

source: དགེ་བའི་ཆོས་ཐམས་ཅད་ལ་ལྷག་པའི་བསམ་པས་སྦྱོར་བ་དང་།
en: applying oneself with good intentions to all virtuous qualities,

source: མ་བསླབས་པ་ཐམས་ཅད་ལ་མི་བརྙས་པ་དང་།
en: not harboring contempt toward anyone who is untrained,

source: གསོལ་བ་མ་བཏབ་པར་སེམས་ཅན་ཐམས་ཅད་ལ་བཤེས་གཉེན་དུ་གྱུར་པ་དང་།
en: becoming a friend to all beings without being asked, and

source: ཡོན་ཏན་ཐམས་ཅད་སྒྲུབ་པ་ལ་ཕྱིར་བྱ་བའི་རེ་བ་མེད་པས་ལན་ལ་མི་རེ་བ་སྟེ།
en: not hoping for any reward because one has already accomplished all manner of good qualities and because one does not wish to be compensated.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་རྣམ་པར་དག་པའོ། །
en: “Divine being, these four are the pure practices of bodhisattvas:

source: བདག་མེད་པའི་ཕྱིར་ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་དང་།
en: pure discipline because of the lack of self,

source: སེམས་ཅན་མེད་པའི་ཕྱིར་ཏིང་ངེ་འཛིན་རྣམ་པར་དག་པ་དང་།
en: pure absorption because of the non-existence of beings,

source: སྲོག་མེད་པའི་ཕྱིར་ཤེས་རབ་རྣམ་པར་དག་པ་དང་།
en: pure insight because of the non-existence of the soul, and

source: གང་ཟག་མེད་པའི་ཕྱིར་རྣམ་པར་གྲོལ་བ་རྣམ་པར་དག་པ་སྟེ།
en: pure liberation because of the non-existence of persons.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྐང་པའོ། །
en: “Divine being, these are the four feet of bodhisattvas:

source: ཆོས་ཀྱི་རྐང་པ་དང་། དོན་གྱི་རྐང་པ་དང་། སྦྱངས་པའི་ཡོན་ཏན་དང་། ཡོ་བྱད་བསྙུངས་པས་འཇུག་པའི་རྐང་པ་དང་། བྱང་ཆུབ་ཀྱི་ལམ་གྱི་ཚོགས་སོགས་པའི་རྐང་པ་སྟེ།
en: the foot of the Dharma, the foot of purpose, the foot of engaging in the ascetic practices and having few possessions, and the foot of gathering the accumulations of the path of awakening.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལག་པའོ། །
en: “Divine being, these are the four hands of bodhisattvas:

source: དད་པའི་ལག་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ལག་པ་དང་། ཐོས་པའི་ལག་པ་དང་། ཤེས་རབ་ཀྱི་ལག་པ་སྟེ།
en: the hand of faith, the hand of discipline, the hand of learning, and the hand of insight.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མིག་གོ། །
en: “Divine being, these are the four eyes of bodhisattvas:

source: ལས་ལེགས་པ་བྱས་པའི་ཕྱིར་ཤའི་མིག་དང་།
en: the physical eye due to correct karmic action,

source: མངོན་པར་ཤེས་པ་ལས་མི་ཉམས་པའི་ཕྱིར་ལྷའི་མིག་དང་།
en: the divine eye due to undiminished supernatural perception,

source: ཤིན་ཏུ་ཐོས་པའི་སྟོབས་དང་ལྡན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་མིག་དང་།
en: the eye of insight due to possessing the power of extensive learning, and

source: ཆོས་ཐམས་ཅད་ལ་ངེས་པར་སེམས་པའི་ཕྱིར་ཆོས་ཀྱི་མིག་སྟེ།
en: the Dharma eye due to reflection on all phenomena.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་ངོམས་པའོ། །
en: “Divine being, these are the four things that bodhisattvas never tire of:

source: སྦྱིན་པས་མི་ངོམས་པ་དང་།
en: they never tire of generosity,

source: དགོན་པ་ལ་གནས་པས་མི་ངོམས་པ་དང་།
en: they never tire of living in the deep forest,

source: ཆོས་ཉན་པས་མི་ངོམས་པ་དང་།
en: they never tire of hearing the Dharma, and

source: དགེ་བའི་ཆོས་ཀྱི་ཚོགས་ཐམས་ཅད་ཀྱིས་མི་ངོམས་པ་སྟེ།
en: they never tire of the entire collection of virtuous qualities.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དཀའ་བ་བྱེད་པའོ། །
en: “Divine being, these are the four hardships of bodhisattvas:

source: སེམས་ཅན་མཐུ་ཆུང་བ་རྣམས་ལ་བཟོད་ཅིང་དང་དུ་བླང་བ་དཀའ་བ་བྱེད་པ་དང་།
en: the hardship of being patient and tolerant toward beings who are weak;

source: དབུལ་པོ་ལ་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བར་བསམ་པ་དཀའ་བ་བྱེད་པ་དང་།
en: the hardship of wanting to give all one’s possessions to the poor;

source: ཡན་ལག་གི་མཆོག་མགོ་སློང་བ་ལ་ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དཀའ་བ་བྱེད་ཀྱི་སྟེང་དུ་དགེ་བའི་བཤེས་གཉེན་དུ་སེམས་བསྐྱེད་པ་དང་།
en: the hardship of not being angry at those who ask for one’s head—that most important body part—but instead generating the thought that they are one’s spiritual teacher; and

source: སྐྱེ་བ་ལ་མི་རྟོག་པས་བསམས་བཞིན་དུ་སྐྱེ་བར་བྱེད་པའི་དཀའ་བ་བྱེད་པ་སྟེ།
en: the hardship of taking birth at will due to not conceptualizing birth.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ནད་མེད་པའོ། །
en: “Divine being, these are the bodhisattvas’ four types of good health:

source: ཁམས་མཉམ་པས་ནད་མེད་པ་དང་།
en: being healthy because the elements are in balance,

source: ཉོན་མོངས་པའི་གདུང་བ་མེད་པས་ནད་མེད་པ་དང་།
en: being healthy because one is not tormented by the afflictions,

source: སེམས་ཅན་ཐམས་ཅད་བདེ་བར་གཞོག་པས་ནད་མེད་པ་དང་།
en: being healthy because one will establish all beings in happiness, and

source: ཆོས་ཐམས་ཅད་ལ་ཐེ་ཙོམ་མེད་པས་ནད་མེད་པ་སྟེ།
en: being healthy because one harbors no doubts regarding any phenomena.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བདག་གི་ཕྱོགས་སོ། །
en: “Divine being, these are the four personal perspectives of bodhisattvas:

source: ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕྱོགས་དང་།
en: the perspective of the perfections,

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཀྱི་ཕྱོགས་དང་།
en: the perspective of the factors of awakening,

source: དགེ་བའི་བཤེས་གཉེན་ཡང་དག་པའི་ཕྱོགས་དང་།
en: the perspective of the authentic spiritual teacher, and

source: སྡིག་པ་ཐམས་ཅད་མི་བྱ་བའི་ཕྱོགས་ཏེ།
en: the perspective of not committing any misdeeds.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་མི་བསྐྱོད་པའོ། །
en: “Divine being, these are the four unshakable qualities that bodhisattvas possess:

source: བྱང་ཆུབ་ཀྱི་སེམས་མི་བསྐྱོད་པ་དང་།
en: the unshakable mind of awakening,

source: ཡི་དམ་མི་བསྐྱོད་པ་དང་།
en: unshakable commitments,

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་ལས་མི་བསྐྱོད་པ་དང་།
en: the unshakable practice of what one preaches, and

source: ཡང་དག་པའི་ནན་ཏན་ལས་མི་བསྐྱོད་པ་སྟེ། བཞི་པོ་དེ་དག་གོ། །
en: unshakable correct exertion.

source: ལྷའི་བུ་བཞི་པོ་འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཚོགས་སོ། །
en: “Divine being, these are the bodhisattvas’ four accumulations:

source: ཞི་གནས་ཀྱི་ཚོགས་དང་།
en: the accumulation of tranquility,

source: ལྷག་མཐོང་གི་ཚོགས་དང་།
en: the accumulation of special insight,

source: ཐོས་པའི་ཚོགས་དང་།
en: the accumulation of learning, and

source: དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀྱི་ཚོགས་ཏེ།
en: the accumulation of all roots of virtue.
